"Flavio Cobolli (ITA) vs [2] Casper Ruud (NOR)     First Meeting.\nFlavio Cobolli | Age: 22 | World No. 56 (Career-High) | 2024: 15-11 (Geneva SF) | Geneva: 3-0 (2024 SF)\n> Broke into Top 200 in January 2022 and Top 100 in October 2023, achieving career-high No. 56 in May 2023.\n> Earned 1st Top 20 win over No. 18 Jarry en route to 1st Grand Slam 3R at 2024 Australian Open as Q.\n> Came through qualifying to earn 2 Top 100 wins en route to 1st ATP Tour QF at 2023 Munich.\n> Saved 3 MPs vs. Giron to win ATP Tour main draw debut 3-6 7-6 7-6 at 2021 Parma as 429th-ranked WC.\n> Won Challenger titles at 2022 Zadar and 2023 Lisbon and reached finals at 2021 Rome-2, 2021 Barletta and 2023\nOlbia.\n> Peaked at No. 8 in juniors and ended junior career by winning 2020 Roland Garros boys’ doubles title w/Stricker.\nNOTE: Cobolli is playing his 1st ATP Tour SF after earning biggest win of career over No. 15 Shelton in 2R. He is 0-2\nagainst the Top 10 (0-1 on clay, l. to No. 1 Alcaraz at 2023 Roland Garros) and would guarantee a Top 50 debut with\na semifinal win. He aims to be the 1st Italian champion in tournament history (Panatta lost in the 1980 final).\nFirst-Time ATP Tour Champions in 2024 (6) - Cobolli and Machac aim to be the 7th first-time champion in 2024\n(one of Etcheverry and Mpetshi Perricard will achieve the same feat in Lyon).\nPlayer    Age  Tournament Player   Age Tournament\nJiri Lehecka   22  Adelaide Facundo Diaz Acosta  23  Buenos Aires\nAlejandro Tabilo   26  Auckland Jordan Thompson 29 Los Cabos\nLuciano Darderi   21  Cordoba Jan-Lennard Struff 33 Munich\nCasper Ruud | Age: 25 | World No. 7 | Career-High No. 2 | 2024: 33-9 (Barcelona Title) | Geneva: 11-1 (2021-22 Title)\n> Top-ranked Norwegian in history rose from No. 7 to career-high No. 2 after falling to Alcaraz in 2022 US Open final\nwith No. 1 ranking at stake.\n> First Norwegian to win an ATP Tour title (11), play at Nitto ATP Finals (‘21 SF, ‘22 final), and reach both a Grand\nSlam final (2022-23 Roland Garros, 2023 US Open) and an ATP Masters 1000 final (‘22 Miami, ’24 Monte-Carlo).\n> Swept clay-court titles at Bastad, Gstaad and Kitzbuhel in July 2021 to become 1st player to win 3 titles in as many\nweeks since Murray at 2011 Bangkok, Tokyo and Shanghai.\n> Former No. 1 junior leads ATP Tour since start of 2020 season in clay-court wins (107), finals (15) and titles (10).\n> Defeated No. 1 Djokovic for biggest win of career en route to 2024 ATP Masters 1000 Monte-Carlo final.\nNOTE: Ruud leads ATP Tour with 33 wins this year and aims to become the 1st 3-time champion in tournament\nhistory (2 - Wilander in 1982-83, Wawrinka in 2016-17, Ruud in 2021-22). He intends to win a 3rd title at one event for\nthe 1st time in his career (2 - 2020, 2022 Buenos Aires, 2021-22 Geneva, 2021-22 Gstaad).\nLEXUS ATP HEAD2HEAD: SINGLES FINAL"
